pandas 入门
Seriese and DataFrame

In [0]:
from pandas import Series ,DataFrame

In [0]:
import pandas as pd

In [0]:
obj = Series([4,7,-5,3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3])

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [0]:
obj2 = Series ([ 4, 7, -5, 3], index= ['d','b','a','c'])

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [10]:
obj2['a'];obj2['b']

7

In [0]:
obj2['d']=6

In [12]:
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [13]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [14]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [15]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [16]:
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [17]:
'b' in obj2

True

In [18]:
'e' in obj2

False

In [0]:
sdata = {'ohio':35000,'texas':71000,'oregon':16000,'utah':5000}

In [0]:
obj3 = Series(sdata)

In [21]:
obj3

ohio      35000
texas     71000
oregon    16000
utah       5000
dtype: int64

In [0]:
states = ['california','ohio','oregon','utah']

In [0]:
obj4 = Series(sdata,index=states)

In [24]:
obj4

california        NaN
ohio          35000.0
oregon        16000.0
utah           5000.0
dtype: float64

In [25]:
pd.isnull(obj4)

california     True
ohio          False
oregon        False
utah          False
dtype: bool

In [26]:
pd.notnull(obj4)

california    False
ohio           True
oregon         True
utah           True
dtype: bool

In [27]:
obj4.isnull()

california     True
ohio          False
oregon        False
utah          False
dtype: bool

In [28]:
obj3

ohio      35000
texas     71000
oregon    16000
utah       5000
dtype: int64

In [29]:
obj4

california        NaN
ohio          35000.0
oregon        16000.0
utah           5000.0
dtype: float64

In [30]:
obj3+obj4

california        NaN
ohio          70000.0
oregon        32000.0
texas             NaN
utah          10000.0
dtype: float64

自动对齐

In [0]:
obj4.name = 'population'

In [0]:
obj4.index.name = 'state'

In [33]:
obj4

state
california        NaN
ohio          35000.0
oregon        16000.0
utah           5000.0
Name: population, dtype: float64

In [0]:
obj4.index = ['b','a','c','e']

In [35]:
obj4

b        NaN
a    35000.0
c    16000.0
e     5000.0
Name: population, dtype: float64

修改索引值

In [0]:
data = {'state':['ohio','ohio','ohio','nevada','nevada'],'year':[2000,2001,2002,2001,2001],'pop':[1.5,1.7,3.6,2.4,2.9]}

In [37]:
data

{'pop': [1.5, 1.7, 3.6, 2.4, 2.9],
 'state': ['ohio', 'ohio', 'ohio', 'nevada', 'nevada'],
 'year': [2000, 2001, 2002, 2001, 2001]}

In [0]:
frame = DataFrame(data)

In [39]:
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2001  2.9

In [40]:
DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  nevada  2.4
4  2001  nevada  2.9

修改列的顺序

In [0]:
frame2 = DataFrame(data,columns=['year','state','pop','debt'],index=['one','two','three','four','five'])

In [42]:
frame2

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  nevada  2.4  NaN
five   2001  nevada  2.9  NaN

In [43]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [44]:
frame2['state']

one        ohio
two        ohio
three      ohio
four     nevada
five     nevada
Name: state, dtype: object

In [45]:
frame2.ix['three']

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year     2002
state    ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [46]:
frame2.loc['three']

year     2002
state    ohio
pop       3.6
debt      NaN
Name: three, dtype: object

frame2.iloc['three']   不行

In [0]:
frame2['debt']=12.5

In [48]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5  12.5
two    2001    ohio  1.7  12.5
three  2002    ohio  3.6  12.5
four   2001  nevada  2.4  12.5
five   2001  nevada  2.9  12.5

In [0]:
frame2['debt']=np.arange(5)

In [50]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5     0
two    2001    ohio  1.7     1
three  2002    ohio  3.6     2
four   2001  nevada  2.4     3
five   2001  nevada  2.9     4

In [0]:
val = Series([-1.2,1.7,2.5],index=['one','two','three'])

In [0]:
frame2['debt']=val

In [53]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5  -1.2
two    2001    ohio  1.7   1.7
three  2002    ohio  3.6   2.5
four   2001  nevada  2.4   NaN
five   2001  nevada  2.9   NaN

In [0]:
frame2['eastern']= frame2.state == 'ohio'

In [55]:
frame2

       year   state  pop  debt  eastern
one    2000    ohio  1.5  -1.2     True
two    2001    ohio  1.7   1.7     True
three  2002    ohio  3.6   2.5     True
four   2001  nevada  2.4   NaN    False
five   2001  nevada  2.9   NaN    False

In [0]:
del frame2['eastern']

In [57]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5  -1.2
two    2001    ohio  1.7   1.7
three  2002    ohio  3.6   2.5
four   2001  nevada  2.4   NaN
five   2001  nevada  2.9   NaN

In [58]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [0]:
pop = {'nevada':{2001:2.4,2009:2.9},'ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [0]:
frame3 = DataFrame(pop)

In [61]:
frame3

      nevada  ohio
2000     NaN   1.5
2001     2.4   1.7
2002     NaN   3.6
2009     2.9   NaN

In [62]:
frame3.T

        2000  2001  2002  2009
nevada   NaN   2.4   NaN   2.9
ohio     1.5   1.7   3.6   NaN

In [63]:
DataFrame(pop,index=[2001,2002,2003])

      nevada  ohio
2001     2.4   1.7
2002     NaN   3.6
2003     NaN   NaN

In [0]:
pdata = {'ohio':frame3['ohio'][:-1],'nevada':frame3['nevada'][:-1]}

In [65]:
pdata

{'nevada': 2000    NaN
 2001    2.4
 2002    NaN
 Name: nevada, dtype: float64, 'ohio': 2000    1.5
 2001    1.7
 2002    3.6
 Name: ohio, dtype: float64}

In [66]:
DataFrame(pdata)

      ohio  nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     NaN

In [0]:
frame3.index.name = 'year';frame3.columns.name='state'

In [68]:
frame3

state  nevada  ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      NaN   3.6
2009      2.9   NaN

In [69]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [nan, 3.6],
       [2.9, nan]])

In [70]:
frame2.values

array([[2000, 'ohio', 1.5, -1.2],
       [2001, 'ohio', 1.7, 1.7],
       [2002, 'ohio', 3.6, 2.5],
       [2001, 'nevada', 2.4, nan],
       [2001, 'nevada', 2.9, nan]], dtype=object)

In [0]:
obj = Series(range(3),index=['a','b','c'])

In [0]:
index = obj.index

In [73]:
index

Index(['a', 'b', 'c'], dtype='object')

In [74]:
index[:1]

Index(['a'], dtype='object')

In [75]:
index[1]='b'

TypeError: ignored

注意index 不可修改

In [0]:
index = pd.Index(np.arange(3))

In [0]:
obj2 = Series([1.5,2.5,0],index=index)

In [78]:
obj2

0    1.5
1    2.5
2    0.0
dtype: float64

In [79]:
obj2.index is index

True

In [80]:
frame3

state  nevada  ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      NaN   3.6
2009      2.9   NaN

In [81]:
'ohio' in frame3.columns

True

In [82]:
2003 in frame3.index

False

In [0]:
obj = Series([4.5, 1.2,	-5.3, 3.6], index=['d','b','a','c'])

In [84]:
obj

d    4.5
b    1.2
a   -5.3
c    3.6
dtype: float64

In [0]:
obj2 = obj.reindex(['a','b','c','d','e'],fill_value = 0)

In [86]:
obj2

a   -5.3
b    1.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [0]:
obj3 = Series(['blue','purple','yellow'],index=[0,2,4])

In [88]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

向前填充

In [0]:
frame = DataFrame(np.arange(9).reshape((3,3)),index=['a','b','c'],columns=['ohio','texas','california'])

In [90]:
frame

   ohio  texas  california
a     0      1           2
b     3      4           5
c     6      7           8

In [0]:
frame2 = frame.reindex(['a','b','c','d'])

In [92]:
frame2

   ohio  texas  california
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

In [0]:
states = ['texas','utah','california']

In [94]:
frame.reindex(columns=states)

   texas  utah  california
a      1   NaN           2
b      4   NaN           5
c      7   NaN           8

In [95]:
frame.reindex(index=['a','b','c','d'],method = 'ffill')

   ohio  texas  california
a     0      1           2
b     3      4           5
c     6      7           8
d     6      7           8

frame.reindex(index=['a','b','c','d'],method = 'ffill',columns = states)出错

In [96]:
frame.reindex(index=['a','b','c','d'],columns=states).ffill()

   texas  utah  california
a    1.0   NaN         2.0
b    4.0   NaN         5.0
c    7.0   NaN         8.0
d    7.0   NaN         8.0

In [97]:
frame.loc[['a','b','c','d'],states]

/usr/local/lib/python3.6/dist-packages/pandas/core/indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   texas  utah  california
a    1.0   NaN         2.0
b    4.0   NaN         5.0
c    7.0   NaN         8.0
d    NaN   NaN         NaN

In [0]:
obj = Series(np.arange(5.),index=['a','b','c','d','e'])

In [0]:
new_obj = obj.drop('c')

In [100]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [101]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [0]:
data = DataFrame(np.arange(16).reshape((4,4)),index = ['ohio','colorado','utah','new work'],columns=['one','two','three','four'])

In [103]:
data.drop(['colorado','ohio'])

          one  two  three  four
utah        8    9     10    11
new work   12   13     14    15

In [104]:
data.drop('two',axis=1)

          one  three  four
ohio        0      2     3
colorado    4      6     7
utah        8     10    11
new work   12     14    15

In [105]:
data.drop(['two','four'],axis = 1)

          one  three
ohio        0      2
colorado    4      6
utah        8     10
new work   12     14

In [106]:
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new work   12   13     14    15

In [0]:
obj = Series(np.arange(4.),index=['a','b','c','d'])

In [108]:
obj['b']

1.0

In [109]:
obj[1]

1.0

In [110]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [111]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [112]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [113]:
obj[obj>2]

d    3.0
dtype: float64

In [114]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [0]:
obj['b':'c']=5

In [116]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [0]:
data = DataFrame(np.arange(16).reshape((4,4)),index=['ohio','colorado','utah','new work'],columns=['one','two','three','four'])

In [118]:
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new work   12   13     14    15

In [119]:
data['two']

ohio         1
colorado     5
utah         9
new work    13
Name: two, dtype: int64

In [120]:
data[['three','one']]

          three  one
ohio          2    0
colorado      6    4
utah         10    8
new work     14   12

In [121]:
data[:2]

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7

In [122]:
data[data['three']>5]

          one  two  three  four
colorado    4    5      6     7
utah        8    9     10    11
new work   12   13     14    15

In [123]:
data<5

            one    two  three   four
ohio       True   True   True   True
colorado   True  False  False  False
utah      False  False  False  False
new work  False  False  False  False

In [0]:
data[data<5]=0

In [125]:
data

          one  two  three  four
ohio        0    0      0     0
colorado    0    5      6     7
utah        8    9     10    11
new work   12   13     14    15

In [126]:
data.loc['colorado',['two','three']]

two      5
three    6
Name: colorado, dtype: int64

In [127]:
data.ix[2]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

one       8
two       9
three    10
four     11
Name: utah, dtype: int64

In [128]:
data.ix[['colorado','utah'],[3,0,1]]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          four  one  two
colorado     7    0    5
utah        11    8    9

In [129]:
data.ix[:'utah','two']

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

ohio        0
colorado    5
utah        9
Name: two, dtype: int64

In [130]:
data.ix[data.three>5,:3]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          one  two  three
colorado    0    5      6
utah        8    9     10
new work   12   13     14

In [0]:
s1 = Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])

In [0]:
s2 = Series([-2.1,3.6,-1.5,4,3.1],index=['a','c','e','f','g'])

In [133]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [134]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [135]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [0]:
df1 = DataFrame(np.arange(9.).reshape((3,3)),columns=list('bcd'),index=['ohio','texas','colorado'])

In [0]:
df2 = DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),index=['utah','ohio','texas','oregon'])

In [138]:
df1

            b    c    d
ohio      0.0  1.0  2.0
texas     3.0  4.0  5.0
colorado  6.0  7.0  8.0

In [139]:
df2

          b     d     e
utah    0.0   1.0   2.0
ohio    3.0   4.0   5.0
texas   6.0   7.0   8.0
oregon  9.0  10.0  11.0

In [140]:
df1 + df2

            b   c     d   e
colorado  NaN NaN   NaN NaN
ohio      3.0 NaN   6.0 NaN
oregon    NaN NaN   NaN NaN
texas     9.0 NaN  12.0 NaN
utah      NaN NaN   NaN NaN

In [141]:
df2 + df1

            b   c     d   e
colorado  NaN NaN   NaN NaN
ohio      3.0 NaN   6.0 NaN
oregon    NaN NaN   NaN NaN
texas     9.0 NaN  12.0 NaN
utah      NaN NaN   NaN NaN

In [0]:
df1 = DataFrame(np.arange(12.).reshape((3,4)),columns=list('abcd'))

In [0]:
df2 = DataFrame(np.arange(20.).reshape((4,5)),columns=list('abcde'))

In [144]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [145]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [146]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [147]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [148]:
df1.reindex(columns = df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [0]:
arr = np.arange(12.).reshape((3,4))

In [150]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [151]:
arr[0]

array([0., 1., 2., 3.])

In [152]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [0]:
frame = DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),index=['utah','ohio','texas','oregon'])

In [154]:
series = frame.ix[0]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [155]:
frame

          b     d     e
utah    0.0   1.0   2.0
ohio    3.0   4.0   5.0
texas   6.0   7.0   8.0
oregon  9.0  10.0  11.0

In [156]:
series

b    0.0
d    1.0
e    2.0
Name: utah, dtype: float64

In [157]:
frame - series

          b    d    e
utah    0.0  0.0  0.0
ohio    3.0  3.0  3.0
texas   6.0  6.0  6.0
oregon  9.0  9.0  9.0

In [0]:
series2 = Series(range(3),index=['b','e','f'])

In [159]:
frame + series2

          b   d     e   f
utah    0.0 NaN   3.0 NaN
ohio    3.0 NaN   6.0 NaN
texas   6.0 NaN   9.0 NaN
oregon  9.0 NaN  12.0 NaN

In [160]:
series2

b    0
e    1
f    2
dtype: int64

In [0]:
series3 = frame['d']

In [162]:
frame

          b     d     e
utah    0.0   1.0   2.0
ohio    3.0   4.0   5.0
texas   6.0   7.0   8.0
oregon  9.0  10.0  11.0

In [163]:
series3

utah       1.0
ohio       4.0
texas      7.0
oregon    10.0
Name: d, dtype: float64

In [164]:
frame.sub(series3,axis=0)

          b    d    e
utah   -1.0  0.0  1.0
ohio   -1.0  0.0  1.0
texas  -1.0  0.0  1.0
oregon -1.0  0.0  1.0

In [0]:
frame = DataFrame(np.random.randn(4,3),columns=list('bde'),index=['utah','ohio','texas','oregon'])

In [166]:
frame

               b         d         e
utah    0.538752 -0.762952 -1.762070
ohio   -1.722755 -0.700888  0.806170
texas  -0.265381  0.242907 -0.333694
oregon  0.179621  0.288406  0.509684

In [167]:
np.abs(frame)

               b         d         e
utah    0.538752  0.762952  1.762070
ohio    1.722755  0.700888  0.806170
texas   0.265381  0.242907  0.333694
oregon  0.179621  0.288406  0.509684

In [0]:
f = lambda x: x.max()-x.min()

In [169]:
frame.apply(f)

b    2.261507
d    1.051359
e    2.568241
dtype: float64

In [170]:
frame.apply(f,axis=1)

utah      2.300823
ohio      2.528925
texas     0.576601
oregon    0.330063
dtype: float64

In [0]:
def f(x):
  return Series([x.min(),x.max()],index=['min','max'])

In [172]:
frame.apply(f)

            b         d        e
min -1.722755 -0.762952 -1.76207
max  0.538752  0.288406  0.80617

In [0]:
format = lambda x:'%.2f'%x

In [174]:
frame.applymap(format)

            b      d      e
utah     0.54  -0.76  -1.76
ohio    -1.72  -0.70   0.81
texas   -0.27   0.24  -0.33
oregon   0.18   0.29   0.51

In [175]:
frame['e'].map(format)

utah      -1.76
ohio       0.81
texas     -0.33
oregon     0.51
Name: e, dtype: object

In [0]:
obj= Series(range(4),index=list('dabc'))

In [177]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [0]:
frame = DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],columns=['d','a','b','c'])

In [179]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [180]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [181]:
frame.sort_index(axis=1,ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [0]:
obj = Series([4,7,-3,2])

In [183]:
obj.order()

AttributeError: ignored

In [184]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [0]:
obj = Series([4,np.nan,7,np.nan,-3,2])

In [186]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [0]:
frame = DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})

In [188]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [189]:
frame.sort_index(by='b')

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [190]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [0]:
obj = Series([7,-5,7,4,2,0,4])

In [192]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [193]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [194]:
obj.rank(ascending = False,method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [0]:
frame = DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})

In [196]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [197]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [0]:
obj = Series(range(5),index=['a','a','b','b','c'])

In [199]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [200]:
obj.index.is_unique

False

In [201]:
obj['a']

a    0
a    1
dtype: int64

In [202]:
obj['c']

4

In [0]:
df = DataFrame(np.random.randn(4,3),index=list('aabb'))

In [204]:
df

          0         1         2
a  0.712438  0.544945 -0.556053
a  0.784922 -2.135059  0.813399
b  1.279119  1.742177  1.832215
b  1.668186  1.849978  1.016138

In [205]:
df.ix['b']

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          0         1         2
b  1.279119  1.742177  1.832215
b  1.668186  1.849978  1.016138

In [0]:
df = DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns =['one','two'])

In [207]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [208]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [209]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [210]:
df.mean(axis=1,skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [211]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [212]:
df.idxmax()

one    b
two    d
dtype: object

In [213]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [214]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [0]:
obj = Series(['a','a','b','c']*4)

In [216]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [217]:
import pandas.io.data as web

ModuleNotFoundError: ignored

In [0]:
import pandas_datareader.data as web

In [0]:
all_data = {}

In [0]:
for ticker in ['AAPL','IBM','MSFT','GOOG']:
  all_data[ticker]=web.get_data_yahoo(ticker,'1/1/2000','1/1/2010')

In [0]:
price = DataFrame({tic:data['Adj Close'] for tic ,data in all_data.items()})

In [0]:
volume = DataFrame({tic:data['Volume'] for tic ,data in all_data.items()})

In [0]:
returns = price.pct_change()

In [224]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2009-12-24  0.034339  0.004385  0.002587  0.011117
2009-12-28  0.012294  0.013326  0.005484  0.007098
2009-12-29 -0.011861 -0.003477  0.007058 -0.005571
2009-12-30  0.012147  0.005461 -0.013699  0.005376
2009-12-31 -0.004300 -0.012597 -0.015504 -0.004416

In [225]:
returns.MSFT.corr(returns.IBM)

0.49414972998906664

In [226]:
returns.MSFT.cov(returns.IBM)

0.00021571280778399425

In [227]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.410011  0.423556  0.470676
IBM   0.410011  1.000000  0.494150  0.390689
MSFT  0.423556  0.494150  1.000000  0.438313
GOOG  0.470676  0.390689  0.438313  1.000000

In [228]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.001027  0.000252  0.000309  0.000303
IBM   0.000252  0.000367  0.000216  0.000142
MSFT  0.000309  0.000216  0.000519  0.000204
GOOG  0.000303  0.000142  0.000204  0.000580

In [229]:
returns.corrwith(returns.IBM)

AAPL    0.410011
IBM     1.000000
MSFT    0.494150
GOOG    0.390689
dtype: float64

In [230]:
returns.corrwith(volume)

AAPL   -0.057549
IBM    -0.007892
MSFT   -0.016118
GOOG    0.062647
dtype: float64

In [0]:
obj = Series(['c','a','d','a','a','b','b','c','c'])

In [0]:
uniques = obj.unique()

In [233]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [234]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [235]:
pd.value_counts(obj.values,sort=False)

a    3
d    1
c    3
b    2
dtype: int64

In [0]:
mask = obj.isin(['b','c'])

In [237]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [238]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [0]:
data = DataFrame({'qu1':[1,3,4,3,4],'qu2':[2,3,1,2,3],'qu3':[1,5,2,4,4]})

In [240]:
data

   qu1  qu2  qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [0]:
result = data.apply(pd.value_counts).fillna(0)

In [242]:
result

   qu1  qu2  qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [0]:
string_data = Series(['aardwark','artichake',np.nan,'avpcado'])

In [244]:
string_data

0     aardwark
1    artichake
2          NaN
3      avpcado
dtype: object

In [245]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [0]:
string_data[0]=None

In [247]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [0]:
from numpy import nan as NA

In [0]:
data = Series([1,NA,3.5,NA,7])

In [250]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [251]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [0]:
data = DataFrame([[1.,6.5,3.],[1,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [0]:
cleaned = data.dropna()

In [254]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [255]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [256]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [0]:
data[4]=NA

In [258]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [259]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [0]:
df = DataFrame(np.random.randn(7,3))

In [261]:
df

          0         1         2
0 -1.380184  0.010681  1.207597
1  0.560797  1.017028  1.081648
2  0.956786  3.216099  1.670178
3 -1.258818  0.322629  1.288290
4 -0.104111  0.035424 -2.217897
5 -0.034744 -0.883321  0.745229
6 -0.550846  2.434512 -0.825048

In [262]:
df.ix[:4,1]=NA ;df.ix[:2,2]=NA

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [263]:
df

          0         1         2
0 -1.380184       NaN       NaN
1  0.560797       NaN       NaN
2  0.956786       NaN       NaN
3 -1.258818       NaN  1.288290
4 -0.104111       NaN -2.217897
5 -0.034744 -0.883321  0.745229
6 -0.550846  2.434512 -0.825048

In [264]:
df.dropna(thresh=3)

          0         1         2
5 -0.034744 -0.883321  0.745229
6 -0.550846  2.434512 -0.825048

In [265]:
df.fillna(0)

          0         1         2
0 -1.380184  0.000000  0.000000
1  0.560797  0.000000  0.000000
2  0.956786  0.000000  0.000000
3 -1.258818  0.000000  1.288290
4 -0.104111  0.000000 -2.217897
5 -0.034744 -0.883321  0.745229
6 -0.550846  2.434512 -0.825048

In [266]:
df.fillna({1:0.5,3:-1})

          0         1         2
0 -1.380184  0.500000       NaN
1  0.560797  0.500000       NaN
2  0.956786  0.500000       NaN
3 -1.258818  0.500000  1.288290
4 -0.104111  0.500000 -2.217897
5 -0.034744 -0.883321  0.745229
6 -0.550846  2.434512 -0.825048

In [0]:
_ = df.fillna(0,inplace = True)

In [268]:
df

          0         1         2
0 -1.380184  0.000000  0.000000
1  0.560797  0.000000  0.000000
2  0.956786  0.000000  0.000000
3 -1.258818  0.000000  1.288290
4 -0.104111  0.000000 -2.217897
5 -0.034744 -0.883321  0.745229
6 -0.550846  2.434512 -0.825048

In [0]:
df = DataFrame(np.random.randn(6,3))

In [0]:
df.loc[2:,1]=NA;df.loc[4:,2]=NA

In [271]:
df

          0         1         2
0 -0.138082  0.647233  0.269274
1 -1.431460 -1.435487  1.791978
2 -0.653795       NaN  0.842512
3  0.526361       NaN -1.434046
4 -0.343744       NaN       NaN
5  1.229155       NaN       NaN

In [272]:
df.fillna(method='ffill')

          0         1         2
0 -0.138082  0.647233  0.269274
1 -1.431460 -1.435487  1.791978
2 -0.653795 -1.435487  0.842512
3  0.526361 -1.435487 -1.434046
4 -0.343744 -1.435487 -1.434046
5  1.229155 -1.435487 -1.434046

In [273]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.138082  0.647233  0.269274
1 -1.431460 -1.435487  1.791978
2 -0.653795 -1.435487  0.842512
3  0.526361 -1.435487 -1.434046
4 -0.343744       NaN -1.434046
5  1.229155       NaN -1.434046

In [0]:
data = Series([1,NA,3.5,NA,7])

In [275]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [0]:
data = Series(np.random.randn(10),index=[['a','a','a','b','b','b','c','c','d','d'],[1,2,3,1,2,3,1,2,2,3]] )

In [278]:
data

a  1   -0.125391
   2   -0.299180
   3   -0.524763
b  1    0.212946
   2    0.120864
   3    0.575441
c  1   -0.300426
   2    0.136471
d  2   -1.008317
   3    2.106536
dtype: float64

In [279]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [280]:
data['b']

1    0.212946
2    0.120864
3    0.575441
dtype: float64

In [281]:
data['b':'c']

b  1    0.212946
   2    0.120864
   3    0.575441
c  1   -0.300426
   2    0.136471
dtype: float64

In [282]:
data.loc[['b','d']]

b  1    0.212946
   2    0.120864
   3    0.575441
d  2   -1.008317
   3    2.106536
dtype: float64

In [283]:
data[:,2]

a   -0.299180
b    0.120864
c    0.136471
d   -1.008317
dtype: float64

内层中进行选取

In [284]:
data.unstack()

          1         2         3
a -0.125391 -0.299180 -0.524763
b  0.212946  0.120864  0.575441
c -0.300426  0.136471       NaN
d       NaN -1.008317  2.106536

In [285]:
data.unstack().stack()

a  1   -0.125391
   2   -0.299180
   3   -0.524763
b  1    0.212946
   2    0.120864
   3    0.575441
c  1   -0.300426
   2    0.136471
d  2   -1.008317
   3    2.106536
dtype: float64

In [0]:
frame = DataFrame(np.arange(12).reshape((4,3)),index=[['a','a','b','b'],[1,2,1,2]],columns=[['ohio','ohio','colorado'],['green','red','green']])

In [287]:
frame

     ohio     colorado
    green red    green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [0]:
frame.index.names=['key1','key2']

In [0]:
frame.columns.names=['state','color']

In [290]:
frame

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [291]:
frame['ohio']

color      green  red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [295]:
MultiIndex.from_arrays([['ohio','ohio','colorado'],['green','red','green']],names =['state','color'])

NameError: ignored

In [294]:
pd.MultiIndex.from_arrays([['ohio','ohio','colorado'],['green','red','green']],names =['state','color'])

MultiIndex(levels=[['colorado', 'ohio'], ['green', 'red']],
           codes=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

In [296]:
frame.swaplevel('key1','key2')

state      ohio     colorado
color     green red    green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [298]:
frame.sortlevel(1)

AttributeError: ignored

In [299]:
frame.sort_index(1)

state     colorado  ohio
color        green green red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [300]:
frame.swaplevel(0,1).sort_index(0)

state      ohio     colorado
color     green red    green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [301]:
frame.sum(level='key2')

state  ohio     colorado
color green red    green
key2
1         6   8       10
2        12  14       16

In [302]:
frame.sum(level='color',axis=1)

color      green  red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [0]:
frame = DataFrame({'a':range(7),'b':range(7,0,-1),'c':['ome','one','one','two','two','two','two'],'d':[0,1,2,0,1,2,3]})

In [304]:
frame

   a  b    c  d
0  0  7  ome  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [0]:
frame2 = frame.set_index(['c','d'])

In [306]:
frame2

       a  b
c   d
ome 0  0  7
one 1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [307]:
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
ome 0  0  7  ome  0
one 1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [308]:
frame2.reset_index()

     c  d  a  b
0  ome  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [0]:
ser = Series(np.arange(3.))

In [310]:
ser[-1]

KeyError: ignored

In [311]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [0]:
ser2 = Series(np.arange(3.),index=['a','b','c'])

In [313]:
ser2[-1]

2.0

In [314]:
ser.ix[:1]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

0    0.0
1    1.0
dtype: float64

In [0]:
ser3 = Series(range(3),index=[-5,1,3])

In [319]:
ser3.iget_value(2)

AttributeError: ignored

In [318]:
ser3.get_values()

array([0, 1, 2])

In [0]:
frame = DataFrame(np.arange(6).reshape((3,2)),index=[2,0,1])

In [321]:
frame.irow(0)

AttributeError: ignored

In [323]:
frame.iloc(0)

In [0]:
import pandas_datareader.data as web

In [326]:
pdata = pd.Panel(dict((stk,web.get_data_yahoo(stk,'1/1/2009','6/1/2012'))for stk in ['AAPL','IBM','MSFT','GOOG']))

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2882: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  exec(code_obj, self.user_global_ns, self.user_ns)

In [327]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 861 (major_axis) x 6 (minor_axis)
Items axis: AAPL to GOOG
Major_axis axis: 2009-01-02 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: High to Adj Close

In [329]:
pdata = pdata.swapaxes('items','minor')

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  """Entry point for launching an IPython kernel.

In [330]:
pdata['Adj Close']

                 AAPL         IBM       MSFT        GOOG
Date
2009-01-02   8.611461   64.220299  15.798766  159.621811
2009-01-05   8.974896   63.816013  15.946410  162.965073
2009-01-06   8.826868   65.587479  16.132925  165.950653
2009-01-07   8.636136   64.529030  15.161531  159.964584
2009-01-08   8.796504   64.080658  15.635570  161.544312
2009-01-09   8.595330   62.257763  15.169296  156.517014
2009-01-12   8.413136   63.000126  15.130442  155.334702
2009-01-13   8.322989   62.728195  15.402435  156.144424
2009-01-14   8.097146   61.147850  14.835141  149.512558
2009-01-15   7.912107   61.831436  14.951706  148.528961
2009-01-16   7.812471   62.419456  15.316952  148.866760
2009-01-20   7.420563   60.258434  14.361100  140.461441
2009-01-21   7.859915   67.197212  15.060501  150.560745
2009-01-22   8.384669   66.204926  13.296452  152.259705
2009-01-23   8.384669   65.778572  13.366391  161.300888
2009-01-26   8.506132   67.329521  13.700548  160.888580
2009-01-27   8.609567   67.373619  13.723866  164.668991
2009-01-28   8.938839   69.696358  14.019168  173.208450
2009-01-29   8.824967   67.998428  13.669465  170.550735
2009-01-30   8.552629   67.366272  13.288682  168.171204
2009-02-02   8.683582   66.837044  13.855976  169.184616
2009-02-03   8.823074   68.711395  14.376640  169.125000
2009-02-04   8.877160   68.233643  14.477663  170.391769
2009-02-05   9.153296   67.924919  14.796290  175.717133
2009-02-06   9.462646   71.051025  15.278094  184.440399
2009-02-09   9.727394   71.553558  15.107129  188.161194
2009-02-10   9.283298   68.930023  14.609776  178.096649
2009-02-11   9.187458   70.326759  14.928392  177.863174
2009-02-12   9.419943   70.260262  14.967243  180.351990
2009-02-13   9.409505   69.351265  14.835141  177.684341
...               ...         ...        ...         ...
2012-04-20  54.371300  155.688675  27.199165  296.104126
2012-04-23  54.249844  154.924225  26.947477  296.869141
2012-04-24  53.166172  156.000671  26.779680  298.692291
2012-04-25  57.884209  158.785294  27.014591  302.889984
2012-04-26  57.665962  160.353073  26.939089  305.746429
2012-04-27  57.219967  161.312485  26.830021  305.502991
2012-04-30  55.415123  161.523102  26.863577  300.470734
2012-05-01  55.239567  162.240662  26.855190  300.262085
2012-05-02  55.604893  162.287491  26.679008  301.667938
2012-05-03  55.210152  161.647903  26.645447  303.535797
2012-05-04  53.637779  159.892914  25.991060  296.556183
2012-05-07  54.039185  158.925690  25.714197  301.812012
2012-05-08  53.915813  157.813461  25.588356  304.415070
2012-05-09  54.010715  157.617645  25.806486  302.606842
2012-05-10  54.137871  157.124161  25.789707  304.847260
2012-05-11  53.776333  157.570602  26.142071  300.659485
2012-05-14  52.970695  156.215576  25.739370  300.048462
2012-05-15  52.491482  155.902252  25.511358  303.580505
2012-05-16  51.818699  156.442688  25.249578  312.432922
2012-05-17  50.304211  155.001465  25.097572  309.511932
2012-05-18  50.328903  153.427109  24.717560  298.260101
2012-05-21  53.261074  154.899689  25.122908  305.070801
2012-05-22  52.852089  154.163406  25.131346  298.458801
2012-05-23  54.141666  153.615128  24.582445  302.760834
2012-05-24  53.644428  153.591629  24.548668  299.879578
2012-05-25  53.356899  152.189529  24.540220  293.853760
2012-05-29  54.303936  153.881409  24.962456  295.249695
2012-05-30  54.958691  152.369705  24.776674  292.214417
2012-05-31  54.822044  151.092957  24.650007  288.553253
2012-06-01  53.233543  148.100861  24.025103  283.645172

[861 rows x 4 columns]

In [331]:
pdata.ix[:,'6/1/2012',:]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

            High         Low        Open       Close       Volume   Adj Close
AAPL   81.807144   80.074287   81.308571   80.141426  130246900.0   53.233543
IBM   191.720001  188.600006  190.119995  189.080002    5206400.0  148.100861
MSFT   28.959999   28.440001   28.760000   28.450001   56634300.0   24.025103
GOOG  284.474762  282.338654  284.047546  283.645172    6155600.0  283.645172

In [332]:
pdata.ix['Adj Close','5/22/2012':,:]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

                 AAPL         IBM       MSFT        GOOG
Date
2012-05-22  52.852089  154.163406  25.131346  298.458801
2012-05-23  54.141666  153.615128  24.582445  302.760834
2012-05-24  53.644428  153.591629  24.548668  299.879578
2012-05-25  53.356899  152.189529  24.540220  293.853760
2012-05-29  54.303936  153.881409  24.962456  295.249695
2012-05-30  54.958691  152.369705  24.776674  292.214417
2012-05-31  54.822044  151.092957  24.650007  288.553253
2012-06-01  53.233543  148.100861  24.025103  283.645172

In [333]:
stacked = pdata.loc[:,'5/30/2012':,:].to_frame()

/usr/local/lib/python3.6/dist-packages/pandas/core/indexing.py:151: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  return self.obj._slice(obj, axis=axis, kind=kind)

In [334]:
stacked

                        High         Low  ...       Volume   Adj Close
Date       minor                          ...
2012-05-30 AAPL    82.855713   80.937141  ...  132357400.0   54.958691
           IBM    195.470001  193.770004  ...    3602500.0  152.369705
           MSFT    29.480000   29.120001  ...   41585500.0   24.776674
           GOOG   294.037567  289.879608  ...    3838100.0  292.214417
2012-05-31 AAPL    83.071426   81.637146  ...  122918600.0   54.822044
           IBM    194.929993  192.000000  ...    9287500.0  151.092957
           MSFT    29.420000   28.940001  ...   39134000.0   24.650007
           GOOG   293.093719  287.629242  ...    5975200.0  288.553253
2012-06-01 AAPL    81.807144   80.074287  ...  130246900.0   53.233543
           IBM    191.720001  188.600006  ...    5206400.0  148.100861
           MSFT    28.959999   28.440001  ...   56634300.0   24.025103
           GOOG   284.474762  282.338654  ...    6155600.0  283.645172

[12 rows x 6 columns]

In [0]:
stacked.to_panel()

In [13]:
!type ch06\ex1.csv # win

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [4]:
import pandas as pd
df = pd.read_csv('ch06/ex1.csv')

In [5]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
pd.read_csv('ch06/ex2.csv',header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [7]:
pd.read_csv('ch06/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
 names = ['a', 'b', 'c', 'd', 'message']

In [10]:
pd.read_csv('ch06/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [11]:
 parsed = pd.read_csv('ch06/csv_mindex.csv',index_col=['key1', 'key2'])

In [12]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [20]:
list(open('ech06/ex3.txt')

SyntaxError: unexpected EOF while parsing (<ipython-input-20-15fd43fda13a>, line 1)

In [21]:
result = pd.read_table('ch06/ex3.txt', sep='\s+')

In [22]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [23]:
!type examples\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [24]:
pd.read_csv('ch06/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [26]:
!type ch06\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [27]:
result = pd.read_csv('ch06/ex5.csv')

In [28]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [29]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [30]:
 result = pd.read_csv('ch06/ex5.csv', na_values=['NULL'])

In [31]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [32]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [33]:
pd.read_csv('ch06/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [34]:
pd.options.display.max_rows = 10 #紧凑显示

In [35]:
result = pd.read_csv('ch06/ex6.csv')

In [36]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [37]:
pd.read_csv('ch06/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [38]:
 chunker = pd.read_csv('ch06/ex6.csv', chunksize=1000)

In [39]:
chunker

In [40]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)

In [41]:
tot

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
     ...
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
Length: 36, dtype: float64

In [42]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [43]:
data = pd.read_csv('ch06/ex5.csv')

In [44]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [45]:
data.to_csv('examples/out.csv')

In [47]:
!type examples\out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [48]:
import sys

In [50]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [51]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [52]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [53]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [55]:
dates = pd.date_range('1/1/2000', periods=7)

In [57]:
import numpy as np
ts = pd.Series(np.arange(7), index=dates)

In [58]:
ts.to_csv('examples/tseries.csv')

In [59]:
!type examples\tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [60]:
!type ch06\ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [61]:
import csv
f = open('ch06/ex7.csv')

In [62]:
reader = csv.reader(f)

In [63]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [64]:
with open('ch06/ex7.csv') as f:
    lines = list(csv.reader(f))

In [65]:
header, values = lines[0], lines[1:]

In [66]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [67]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [68]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
reader = csv.reader(f, dialect=my_dialect)

TypeError: argument 1 must be an iterator

In [69]:
reader = csv.reader(f, delimiter='|')

TypeError: argument 1 must be an iterator

In [70]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

In [73]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [74]:
import json

In [75]:
result = json.loads(obj)

In [76]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [77]:
asjson = json.dumps(result)

In [78]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [79]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [80]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [81]:
 !type ch06\example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [82]:
data = pd.read_json('ch06/example.json')

In [83]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [84]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [85]:
 print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [87]:
tables = pd.read_html('ch06/fdic_failed_bank_list.html')

In [88]:
len(tables)

1

In [89]:
failures = tables[0]

In [90]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [91]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [92]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [93]:
from lxml import objectify

In [94]:
path = 'datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [95]:
data = []

In [96]:
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']

In [97]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [98]:
perf = pd.DataFrame(data)

In [99]:
perf.head()

,AGENCY_NAME,CATEGORY,DESCRIPTION,FREQUENCY,INDICATOR_NAME,INDICATOR_UNIT,MONTHLY_ACTUAL,MONTHLY_TARGET,PERIOD_MONTH,PERIOD_YEAR,YTD_ACTUAL,YTD_TARGET
0,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,1,2008,96.9,95
1,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95,95,2,2008,96,95
2,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,3,2008,96.3,95
3,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,98.3,95,4,2008,96.8,95
4,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95.8,95,5,2008,96.6,95

In [100]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [101]:
root

In [102]:
root.get('href')

'http://www.google.com'

In [103]:
root.text

'Google'

In [104]:
frame = pd.read_csv('ch06/ex1.csv')

In [105]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [106]:
frame.to_pickle('examples/frame_pickle')

In [107]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [108]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [109]:
store = pd.HDFStore('mydata.h5')

ImportError: HDFStore requires PyTables, "No module named 'tables'" problem importing

In [110]:
xlsx = pd.ExcelFile('ch06/ex1.xlsx')

In [111]:
pd.read_excel(xlsx, 'Sheet1')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [112]:
frame = pd.read_excel('ch06/ex1.xlsx', 'Sheet1')

In [113]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [114]:
writer = pd.ExcelWriter('ch06/ex2.xlsx')

In [115]:
frame.to_excel(writer, 'Sheet1')

In [116]:
frame.to_excel('examples/ex2.xlsx')

In [117]:
import requests

In [118]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [119]:
resp = requests.get(url)

In [120]:
resp

In [121]:
data = resp.json()

In [122]:
data[0]['title']

'Grouping, then resampling empty DataFrame leads to it losing column names and index'

In [123]:
issues = pd.DataFrame(data, columns=['number', 'title','labels', 'state'])

In [124]:
issues

,number,title,labels,state
0,26411,"Grouping, then resampling empty DataFrame lead...",[],open
1,26410,"API: getting the ""densified"" values of a Categ...","[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
2,26409,DEPR: deprecate get_values,[],open
3,26408,BUG: MultiIndex not dropping nan level and inv...,"[{'id': 2822342, 'node_id': 'MDU6TGFiZWwyODIyM...",open
4,26407,SparseArrays backed by other Extension array/d...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
...,...,...,...,...
25,26379,BUG: Series.combine_first with mixed timezones,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,26377,Fix type annotations in pandas.core.ops,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
27,26376,pd.read_fwf fails with file pointer to url,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
28,26374,BUG: ngroups and len(groups) do not equal when...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
29,26372,Misc Type Annotation fixes,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open

In [125]:
import sqlite3

In [126]:
query = """
   .....: CREATE TABLE test
   .....: (a VARCHAR(20), b VARCHAR(20),
   .....:  c REAL,        d INTEGER
   .....: );"""

In [127]:
con = sqlite3.connect('mydata.sqlite')

In [128]:
con.execute(query)

In [129]:
con.commit()

In [131]:
data = [('Atlanta', 'Georgia', 1.25, 6),
   .....:         ('Tallahassee', 'Florida', 2.6, 3),
   .....:         ('Sacramento', 'California', 1.7, 5)]

In [132]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [133]:
con.executemany(stmt, data)

In [134]:
cursor = con.execute('select * from test')

In [135]:
rows = cursor.fetchall()

In [136]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [137]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [138]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [139]:
import sqlalchemy as sqla

ModuleNotFoundError: No module named 'sqlalchemy'